
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 2 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.POSTGRES-PASS-V112
* Delete
  * azurerm_key_vault_secret.POSTGRES-PASS-V11
  * azurerm_key_vault_secret.POSTGRES-USER-V11


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-PASS-V11 will be destroyed
  - resource "azurerm_key_vault_secret" "POSTGRES-PASS-V11" {
      - content_type   = "" -> null
      - id             = "https://plumsi-aat.vault.azure.net/secrets/recipe-backend-POSTGRES-PASS-v11/189861c3d1ac4c03b875457bbc146b43" -> null
      - key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/plum-shared-infrastructure-aat/providers/Microsoft.KeyVault/vaults/plumsi-aat" -> null
      - name           = "recipe-backend-POSTGRES-PASS-v11" -> null
      - tags           = {} -> null
      - value          = (sensitive value)
      - version        = "189861c3d1ac4c03b875457bbc146b43" -> null
      - versionless_id = "https://plumsi-aat.vault.azure.net/secrets/recipe-backend-POSTGRES-PASS-v11" -> null
    }

  # azurerm_key_vault_secret.POSTGRES-PASS-V112 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-PASS-V112" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/plum-shared-infrastructure-aat/providers/Microsoft.KeyVault/vaults/plumsi-aat"
      + name           = "recipe-backend-POSTGRES-PASS-v112"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-USER-V11 will be destroyed
  - resource "azurerm_key_vault_secret" "POSTGRES-USER-V11" {
      - id             = "https://plumsi-aat.vault.azure.net/secrets/recipe-backend-POSTGRES-USER-v11/353903f48bb8401694e653bbe1e9d621" -> null
      - key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/plum-shared-infrastructure-aat/providers/Microsoft.KeyVault/vaults/plumsi-aat" -> null
      - name           = "recipe-backend-POSTGRES-USER-v11" -> null
      - tags           = {} -> null
      - value          = (sensitive value)
      - version        = "353903f48bb8401694e653bbe1e9d621" -> null
      - versionless_id = "https://plumsi-aat.vault.azure.net/secrets/recipe-backend-POSTGRES-USER-v11" -> null
    }

Plan: 1 to add, 0 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":552,"Program":"tfcmt","SHA1":"","Vars":{}} -->